#include "System_Init.h"

/*
*****************************************************************
 * 函数原型： void System_Init(void)
 * 功    能： 系统功能初始化
*****************************************************************
*/
void System_Init(void)
{
	/**********系统初始化成功**********/
	sys.Init_ok = 0;
    	
	/**********电机初始化**********/
    Drv_Motor_Init();
	
	/**********编码器初始化**********/
    Encoder_Init();
	
	/**********系统参数初始化**********/
	Motor_PID();//pid系数初始化
	
	/**********参数初始化**************/
	Speed.Set = 200;//转速
	Time.Set = 0;//将设定时间存储到临时时间和控制时间
	SetOK_Flag = 1;
    
    /**********开机蜂鸣器响***********/
	Beep_Time = 0.1;//蜂鸣器响0.1S

	/**********系统初始化成功**********/
	sys.Init_ok = 1;
}
