#include "System_Init.h"

/*
*****************************************************************
 * 函数原型： void System_Init(void)
 * 功    能： 系统功能初始化
*****************************************************************
*/
void System_Init(void)
{
	/**********系统初始化成功**********/
	sys.Init_ok = 0;
    	
	/**********电机初始化**********/
    Motor_Init();
	
	/**********编码器初始化**********/
    Encoder_Init();
	
	/**********系统参数初始化**********/
	PID_Init();//pid系数初始化
    Speed = Ctrl_Speed = Set_Speed = 200;//将设定速度存储到临时速度和控制速度
	Time = Ctrl_Time = Set_Time = 0;//将设定时间存储到临时时间和控制时间
	if(Set_Time == 0)
		Time_State = 1;//时间开机显示“----”
	Beep_Time = 0.1;//蜂鸣器响0.1S

	/**********系统初始化成功**********/
	sys.Init_ok = 1;
}
