#include "System_Init.h"

/*
*****************************************************************
 * 函数原型： void System_Init(void)
 * 功    能： 系统功能初始化
*****************************************************************
*/
void System_Init(void)
{
	/**********系统初始化成功**********/
	sys.Init_ok = 0;
    
    /**********PID初始化**********/  
    PID_Init();
    
    /**********电机初始化**********/  
    Motor_Init();
    
    /**********电调初始化**********/  
    Encoder_Init();
    
    /**********参数初始化**********/  
	Param_Read();
	
	/*********ADC&DMA初始化********/  
	ADCDMA_Init();
	
	/**********加热初始化**********/  
	HEAT_Init();
	
	/**********LCD初始化***************/
	Lcd_Init();
	
	/**********蜂鸣器开机响********/ 
	Beep_Time = 0.1;
	
	/***************系统初始化成功**********/
	sys.Init_ok = 1;
}
