#include "System_Init.h"

/*
*****************************************************************
 * 函数原型： void System_Init(void)
 * 功    能： 系统功能初始化
*****************************************************************
*/
void System_Init(void)
{
	/**********系统初始化成功**********/
	sys.Init_ok = 0;

    /**********Key驱动初始化**********/
    Drv_Key_Init();
    
	/**********Motor驱动初始化**********/
	Drv_Motor_Init();

	/**********系统初始化成功**********/
	sys.Init_ok = 1; 

	/**********配置Time0定时器**********/
	TMR0_Config();
}
