#include "System_Init.h"

/**
 * @brief 系统驱动初始化
 *
 */
void System_Init(void)
{
    /**********系统初始化开始**********/
    sys.Init_ok = 0;

    /**********参数初始化*************/
    Param_Read();

    /**********电机初始化*************/
    Drv_Motor_Init();

    /**********测速初始化*************/
    Encoder_Init();

    /**********电机PID初始化**********/
    Motor_PID();

    /**********EC11A初始化定时器*******/
    EC11A_Init();

    /**********WS2812初始化**********/
    WS2812_Init();

    /**********LCD初始化*************/
    Lcd_Init();

    /**********ADC&DMA初始化***********/
    //	ADCDMA_Init();

    /**********开机蜂鸣器响***********/
    Beep_Time = 0.1f;

    /**********系统初始化成功**********/
    sys.Init_ok = 1;
}
