#include "LCDFont.h"

uint8_t seg[Seg_Buff_Size] = {0}; // 存储显示数据

/* 定义数字和一些常用的字母之类的断码组合 */
const uint8_t SegmentCodes[20] = {
	0x3F, // 0 - ABCDEF
	0x06, // 1 - BC
	0x5B, // 2 - ABGED
	0x4F, // 3 - ABGCD
	0x66, // 4 - FBGC
	0x6D, // 5 - AFGCD
	0x7D, // 6 - AFGECD
	0x07, // 7 - ABC
	0x7F, // 8 - ABCDEFG
	0x6F, // 9 - ABCDFG
	0x40, // - - G
	0x77, // A - ABCEFG
	0x7C, // B - CDEFG
	0x39, // C - ADEF
	0x5E, // D - BCDEG
	0x79, // E - ADEFG
	0x71, // F - AEFG
	0x3D, // G - ACDEF
	0x73, // P - ABEFG
	0x00  // 不显示
};

/* 定义数字和一些常用的字母之类的断码组合 */
uint8_t Bit_Comparison[SEG_COUNT] =
	{
		0x01,
		0x02,
		0x04,
		0x08,
		0x10,
		0x20,
		0x40,
};

/* 每位数字断码的seg状态分布 */
SegmentMapping DigitSegmentMap[Location_COUNT][SEG_COUNT] = {
	// 实际速度的第一位
	{
		{7, 0x02}, // A段: 地址54, 数据0x01
		{8, 0x02}, // B段
		{8, 0x08}, // C段
		{7, 0x10}, // D段
		{7, 0x08}, // E段
		{7, 0x04}, // F段
		{8, 0x04}, // G段
	},
	// 实际速度的第二位
	{
		{22, 0x02}, // A段: 地址54, 数据0x01
		{21, 0x02}, // B段
		{21, 0x08}, // C段
		{22, 0x10}, // D段
		{22, 0x08}, // E段
		{22, 0x04}, // F段
		{21, 0x04}, // G段
	},
	// 实际速度的第三位
	{
		{20, 0x02}, // A段: 地址54, 数据0x01
		{19, 0x02}, // B段
		{19, 0x08}, // C段
		{20, 0x10}, // D段
		{20, 0x08}, // E段
		{20, 0x04}, // F段
		{19, 0x04}, // G段
	},
	// 实际速度的第四位
	{
		{18, 0x02}, // A段: 地址54, 数据0x01
		{17, 0x02}, // B段
		{17, 0x08}, // C段
		{18, 0x10}, // D段
		{18, 0x08}, // E段
		{18, 0x04}, // F段
		{17, 0x04}, // G段
	},
	// 设定速度的第一位
	{
		{8, 0x10}, // A段: 地址54, 数据0x01
		{8, 0x20}, // B段
		{8, 0x40}, // C段
		{8, 0x80}, // D段
		{7, 0x80}, // E段
		{7, 0x20}, // F段
		{7, 0x40}, // G段
	},
	// 设定速度的第二位
	{
		{21, 0x10}, // A段: 地址54, 数据0x01
		{21, 0x20}, // B段
		{21, 0x40}, // C段
		{21, 0x80}, // D段
		{22, 0x80}, // E段
		{22, 0x20}, // F段
		{22, 0x40}, // G段
	},
	// 设定速度的第三位
	{
		{19, 0x10}, // A段: 地址54, 数据0x01
		{19, 0x20}, // B段
		{19, 0x40}, // C段
		{19, 0x80}, // D段
		{20, 0x80}, // E段
		{20, 0x20}, // F段
		{20, 0x40}, // G段
	},
	// 设定速度的第四位
	{
		{17, 0x10}, // A段: 地址54, 数据0x01
		{17, 0x20}, // B段
		{17, 0x40}, // C段
		{17, 0x80}, // D段
		{18, 0x80}, // E段
		{18, 0x20}, // F段
		{18, 0x40}, // G段
	},
	// 实际时间的第一位
	{
		{28, 0x01}, // A段: 地址54, 数据0x01
		{0, 0x01},	// B段
		{0, 0x04},	// C段
		{28, 0x08}, // D段
		{28, 0x04}, // E段
		{28, 0x02}, // F段
		{0, 0x02},	// G段
	},
	// 实际时间的第二位
	{
		{1, 0x01}, // A段: 地址54, 数据0x01
		{2, 0x01}, // B段
		{2, 0x04}, // C段
		{1, 0x08}, // D段
		{1, 0x04}, // E段
		{1, 0x02}, // F段
		{2, 0x02}, // G段
	},
	// 实际时间的第三位
	{
		{3, 0x01}, // A段: 地址54, 数据0x01
		{4, 0x01}, // B段
		{4, 0x04}, // C段
		{3, 0x08}, // D段
		{3, 0x04}, // E段
		{3, 0x02}, // F段
		{4, 0x02}, // G段
	},
	// 实际时间的第四位
	{
		{5, 0x01}, // A段: 地址54, 数据0x01
		{6, 0x01}, // B段
		{6, 0x04}, // C段
		{5, 0x08}, // D段
		{5, 0x04}, // E段
		{5, 0x02}, // F段
		{6, 0x02}, // G段
	},
	// 设定时间的第一位
	{
		{26, 0x02}, // A段: 地址54, 数据0x01
		{26, 0x08}, // B段
		{26, 0x40}, // C段
		{26, 0x80}, // D段
		{26, 0x20}, // E段
		{26, 0x04}, // F段
		{26, 0x10}, // G段
	},
	// 设定时间的第二位
	{
		{25, 0x02}, // A段: 地址54, 数据0x01
		{25, 0x08}, // B段
		{25, 0x40}, // C段
		{25, 0x80}, // D段
		{25, 0x20}, // E段
		{25, 0x04}, // F段
		{25, 0x10}, // G段
	},
	// 设定时间的第三位
	{
		{24, 0x02}, // A段: 地址54, 数据0x01
		{24, 0x08}, // B段
		{24, 0x40}, // C段
		{24, 0x80}, // D段
		{24, 0x20}, // E段
		{24, 0x04}, // F段
		{24, 0x10}, // G段
	},
	// 设定时间的第四位
	{
		{23, 0x02}, // A段: 地址54, 数据0x01
		{23, 0x08}, // B段
		{23, 0x40}, // C段
		{23, 0x80}, // D段
		{23, 0x20}, // E段
		{23, 0x04}, // F段
		{23, 0x10}, // G段
	},
	// P的第一位
	{
		{1, 0x10}, // A段: 地址54, 数据0x01
		{1, 0x20}, // B段
		{1, 0x40}, // C段
		{1, 0x80}, // D段
		{0, 0x40}, // E段
		{0, 0x10}, // F段
		{0, 0x20}, // G段
	},
	// P的第二位
	{
		{3, 0x10}, // A段: 地址54, 数据0x01
		{3, 0x20}, // B段
		{3, 0x40}, // C段
		{3, 0x80}, // D段
		{2, 0x80}, // E段
		{2, 0x20}, // F段
		{2, 0x40}, // G段
	},
	// P的第三位
	{
		{5, 0x10}, // A段: 地址54, 数据0x01
		{5, 0x20}, // B段
		{5, 0x40}, // C段
		{5, 0x80}, // D段
		{4, 0x40}, // E段
		{4, 0x10}, // F段
		{4, 0x20}, // G段
	},
};

/**
 * @brief 位数计算
 *
 * @param *bit 输入的位数
 * @param num 与等于的数
 * @param num1 或等于的数
 */
void bit_Cal(uint8_t bit, uint8_t num, uint8_t num1)
{
	seg[bit] &= (0xFF - num);
	seg[bit] |= num1;
}

/**
 * @brief 显示一个数字
 *
 * @param Loc 显示的位置
 * @param number 要显示的数字(0-9)或者其他常用字符
 */
void ShowDigit(uint8_t Loc, uint8_t number)
{
	for (uint8_t segIdx = 0; segIdx < SEG_COUNT; segIdx++)
	{
		SegmentMapping mapping = DigitSegmentMap[Loc][segIdx];
		if (SegmentCodes[number] & Bit_Comparison[segIdx])
		{
			bit_Cal(mapping.address, mapping.value, mapping.value);
		}
		else
		{
			bit_Cal(mapping.address, mapping.value, 0x00);
		}
	}
}
