#include "System_Init.h"

/*
*****************************************************************
 * 函数原型： void System_Init(void)
 * 功    能： 系统功能初始化
*****************************************************************
*/
void System_Init(void)
{	
	/**********系统初始化成功**********/
	sys.Init_ok = 0;
    
    /**********参数初始化**************/
	Param_Read();
     
    /**********加热初始化**************/
	HEAT_Init();
    
//    /**********温度PID初始化***********/
//	Temp_PID();
//    
    Temp_Init();

    /**********TM1640初始化************/
	TM1640_Init();
    
	/**********蜂鸣器响0.1S************/  
	Beep_Time = 0.1;

	/***************系统初始化成功**********/
	sys.Init_ok = 1;
}
