#include "LCDFont.h"

uint8_t seg[Seg_Buff_Size] = {0};//存储显示数据

/* 定义数字和一些常用的字母之类的断码组合 */
const uint8_t SegmentCodes[19] = {
    0x3F, // 0 - ABCDEF
    0x06, // 1 - BC
    0x5B, // 2 - ABGED
    0x4F, // 3 - ABGCD
    0x66, // 4 - FBGC
    0x6D, // 5 - AFGCD
    0x7D, // 6 - AFGECD
    0x07, // 7 - ABC
    0x7F, // 8 - ABCDEFG
    0x6F, // 9 - ABCDFG
	0x40, // - - G
	0x77, // A - ABCEFG
	0x7C, // B - CDEFG
	0x39, // C - ADEF
	0x5E, // D - BCDEG
	0x79, // E - ADEFG
	0x71, // F - AEFG
	0x3D, // G - ACDEF
    0x00 //不显示
};

/* 定义数字和一些常用的字母之类的断码组合 */
uint8_t Bit_Comparison[SEG_COUNT] = 
{
	0x01,
	0x02,
	0x04,
	0x08,
	0x10,
	0x20,
	0x40,
};

/* 每位数字断码的seg状态分布 */
SegmentMapping DigitSegmentMap[Location_COUNT][SEG_COUNT] = {
    /* 工位1 */
    // 工位1的实际转速，第2位
    {
        {54, 0x01}, // A段: 地址54, 数据0x01
        {54, 0x02}, // B段
        {52, 0x10}, // C段
        {54, 0x10}, // D段
        {56, 0x08}, // E段
        {54, 0x04}, // F段
        {54, 0x08}, // G段
    },
    // 工位1的实际转速，第3位
    {
        {52, 0x01}, // A段
        {50, 0x01}, // B段
        {50, 0x04}, // C段
        {52, 0x08}, // D段
        {52, 0x04}, // E段
        {52, 0x02}, // F段
        {50, 0x02}, // G段
    },
    //工位1的设定速度的第二位
    {
        {46, 0x02}, // A段
        {46, 0x04}, // B段
        {46, 0x10}, // C段
        {46, 0x20}, // D段
        {48, 0x10}, // E段
        {48, 0x04}, // F段
        {48, 0x08}, // G段
    },
    //工位1的设定速度的第三位
    {
        {44, 0x01}, // A段
        {42, 0x02}, // B段
        {42, 0x04}, // C段
        {44, 0x08}, // D段
        {46, 0x08}, // E段
        {44, 0x02}, // F段
        {44, 0x04}, // G段
    },

    //工位1的实际温度的第一位
    {
        {58, 0x10}, // A段
        {58, 0x20}, // B段
        {59, 0x01}, // C段
        {59, 0x04}, // D段
        {59, 0x02}, // E段
        {58, 0x40}, // F段
        {58, 0x80}, // G段
    },
	//工位1的实际温度的第二位
    {
        {56, 0x10}, // A段
        {56, 0x20}, // B段
        {57, 0x01}, // C段
        {57, 0x04}, // D段
        {57, 0x02}, // E段
        {56, 0x40}, // F段
        {56, 0x80}, // G段
    },
    //工位1的实际温度的第三位
    {
        {54, 0x20}, // A段
        {52, 0x40}, // B段
        {52, 0x80}, // C段
        {55, 0x02}, // D段
        {55, 0x01}, // E段
        {54, 0x40}, // F段
        {54, 0x80}, // G段
    },
	//工位1的实际温度的第四位
    {
        {50, 0x08}, // A段
        {50, 0x10}, // B段
        {50, 0x40}, // C段
        {51, 0x01}, // D段
        {50, 0x80}, // E段
        {52, 0x20}, // F段
        {50, 0x20}, // G段
    },

    //工位1的设定温度的第一位
    {
        {48, 0x20}, // A段
        {46, 0x40}, // B段
        {47, 0x01}, // C段
        {49, 0x01}, // D段
        {48, 0x80}, // E段
        {48, 0x40}, // F段
        {46, 0x80}, // G段
    },
	//工位1的设定温度的第二位
    {
        {44, 0x10}, // A段
        {44, 0x20}, // B段
        {45, 0x01}, // C段
        {45, 0x04}, // D段
        {45, 0x02}, // E段
        {44, 0x40}, // F段
        {44, 0x80}, // G段
    },
    //工位1的设定温度的第三位
    {
        {42, 0x08}, // A段
        {42, 0x10}, // B段
        {42, 0x80}, // C段
        {43, 0x02}, // D段
        {43, 0x01}, // E段
        {42, 0x20}, // F段
        {42, 0x40}, // G段
    },
	//工位1的设定温度的第四位
    {
        {40, 0x04}, // A段
        {40, 0x08}, // B段
        {40, 0x40}, // C段
        {41, 0x01}, // D段
        {40, 0x80}, // E段
        {40, 0x10}, // F段
        {40, 0x20}, // G段
    },

    //工位1的实际时间的第一位
    {
        {59, 0x08}, // A段
        {57, 0x20}, // B段
        {57, 0x40}, // C段
        {57, 0x80}, // D段
        {59, 0x40}, // E段
        {59, 0x10}, // F段
        {59, 0x20}, // G段
    },
	//工位1的实际时间的第二位
    {
        {57, 0x08}, // A段
        {55, 0x08}, // B段
        {55, 0x40}, // C段
        {55, 0x80}, // D段
        {55, 0x20}, // E段
        {57, 0x10}, // F段
        {55, 0x10}, // G段
    },
    //工位1的实际时间的第三位
    {
        {53, 0x02}, // A段
        {53, 0x04}, // B段
        {53, 0x20}, // C段
        {53, 0x80}, // D段
        {53, 0x40}, // E段
        {53, 0x08}, // F段
        {53, 0x10}, // G段
    },
	//工位1的实际时间的第四位
    {
        {51, 0x02}, // A段
        {51, 0x04}, // B段
        {51, 0x20}, // C段
        {51, 0x80}, // D段
        {51, 0x40}, // E段
        {51, 0x08}, // F段
        {51, 0x10}, // G段
    },

    //工位1的设定时间的第一位
    {
        {49, 0x02}, // A段
        {49, 0x04}, // B段
        {49, 0x20}, // C段
        {49, 0x80}, // D段
        {49, 0x40}, // E段
        {49, 0x08}, // F段
        {49, 0x10}, // G段
    },
	//工位1的设定时间的第二位
    {
        {47, 0x02}, // A段
        {47, 0x04}, // B段
        {47, 0x20}, // C段
        {47, 0x80}, // D段
        {47, 0x40}, // E段
        {47, 0x08}, // F段
        {47, 0x10}, // G段
    },
    //工位1的设定时间的第三位
    {
        {45, 0x08}, // A段
        {43, 0x08}, // B段
        {43, 0x20}, // C段
        {45, 0x80}, // D段
        {45, 0x40}, // E段
        {45, 0x10}, // F段
        {43, 0x10}, // G段
    },
	//工位1的设定时间的第四位
    {
        {41, 0x02}, // A段
        {41, 0x04}, // B段
        {41, 0x20}, // C段
        {43, 0x80}, // D段
        {43, 0x40}, // E段
        {41, 0x08}, // F段
        {41, 0x10}, // G段
    },

    /* 工位2 */
    // 工位2的实际转速，第2位
    {
        {34, 0x01}, // A段: 地址54, 数据0x01
        {34, 0x02}, // B段
        {32, 0x10}, // C段
        {34, 0x10}, // D段
        {36, 0x08}, // E段
        {34, 0x04}, // F段
        {34, 0x08}, // G段
    },
    // 工位2的实际转速，第3位
    {
        {32, 0x01}, // A段
        {30, 0x01}, // B段
        {30, 0x04}, // C段
        {32, 0x08}, // D段
        {32, 0x04}, // E段
        {32, 0x02}, // F段
        {30, 0x02}, // G段
    },
    //工位2的设定速度的第二位
    {
        {26, 0x02}, // A段
        {26, 0x04}, // B段
        {26, 0x10}, // C段
        {26, 0x20}, // D段
        {28, 0x10}, // E段
        {28, 0x04}, // F段
        {28, 0x08}, // G段
    },
    //工位2的设定速度的第三位
    {
        {24, 0x01}, // A段
        {22, 0x02}, // B段
        {22, 0x04}, // C段
        {24, 0x08}, // D段
        {26, 0x08}, // E段
        {24, 0x02}, // F段
        {24, 0x04}, // G段
    },

    //工位2的实际温度的第一位
    {
        {38, 0x10}, // A段
        {38, 0x20}, // B段
        {39, 0x01}, // C段
        {39, 0x04}, // D段
        {39, 0x02}, // E段
        {38, 0x40}, // F段
        {38, 0x80}, // G段
    },
	//工位2的实际温度的第二位
    {
        {36, 0x10}, // A段
        {36, 0x20}, // B段
        {37, 0x01}, // C段
        {37, 0x04}, // D段
        {37, 0x02}, // E段
        {36, 0x40}, // F段
        {36, 0x80}, // G段
    },
    //工位2的实际温度的第三位
    {
        {34, 0x20}, // A段
        {32, 0x40}, // B段
        {32, 0x80}, // C段
        {35, 0x02}, // D段
        {35, 0x01}, // E段
        {34, 0x40}, // F段
        {34, 0x80}, // G段
    },
	//工位2的实际温度的第四位
    {
        {30, 0x08}, // A段
        {30, 0x10}, // B段
        {30, 0x40}, // C段
        {31, 0x01}, // D段
        {30, 0x80}, // E段
        {32, 0x20}, // F段
        {30, 0x20}, // G段
    },

    //工位2的设定温度的第一位
    {
        {28, 0x20}, // A段
        {26, 0x40}, // B段
        {27, 0x01}, // C段
        {29, 0x01}, // D段
        {28, 0x80}, // E段
        {28, 0x40}, // F段
        {26, 0x80}, // G段
    },
	//工位2的设定温度的第二位
    {
        {24, 0x10}, // A段
        {24, 0x20}, // B段
        {25, 0x01}, // C段
        {25, 0x04}, // D段
        {25, 0x02}, // E段
        {24, 0x40}, // F段
        {24, 0x80}, // G段
    },
    //工位2的设定温度的第三位
    {
        {22, 0x08}, // A段
        {22, 0x10}, // B段
        {22, 0x80}, // C段
        {23, 0x02}, // D段
        {23, 0x01}, // E段
        {22, 0x20}, // F段
        {22, 0x40}, // G段
    },
	//工位2的设定温度的第四位
    {
        {20, 0x04}, // A段
        {20, 0x08}, // B段
        {20, 0x40}, // C段
        {21, 0x01}, // D段
        {20, 0x80}, // E段
        {20, 0x10}, // F段
        {20, 0x20}, // G段
    },

    //工位2的实际时间的第一位
    {
        {39, 0x08}, // A段
        {37, 0x20}, // B段
        {37, 0x40}, // C段
        {37, 0x80}, // D段
        {39, 0x40}, // E段
        {39, 0x10}, // F段
        {39, 0x20}, // G段
    },
	//工位2的实际时间的第二位
    {
        {37, 0x08}, // A段
        {35, 0x08}, // B段
        {35, 0x40}, // C段
        {35, 0x80}, // D段
        {35, 0x20}, // E段
        {37, 0x10}, // F段
        {35, 0x10}, // G段
    },
    //工位2的实际时间的第三位
    {
        {33, 0x02}, // A段
        {33, 0x04}, // B段
        {33, 0x20}, // C段
        {33, 0x80}, // D段
        {33, 0x40}, // E段
        {33, 0x08}, // F段
        {33, 0x10}, // G段
    },
	//工位2的实际时间的第四位
    {
        {31, 0x02}, // A段
        {31, 0x04}, // B段
        {31, 0x20}, // C段
        {31, 0x80}, // D段
        {31, 0x40}, // E段
        {31, 0x08}, // F段
        {31, 0x10}, // G段
    },

    //工位2的设定时间的第一位
    {
        {29, 0x02}, // A段
        {29, 0x04}, // B段
        {29, 0x20}, // C段
        {29, 0x80}, // D段
        {29, 0x40}, // E段
        {29, 0x08}, // F段
        {29, 0x10}, // G段
    },
	//工位2的设定时间的第二位
    {
        {27, 0x02}, // A段
        {27, 0x04}, // B段
        {27, 0x20}, // C段
        {27, 0x80}, // D段
        {27, 0x40}, // E段
        {27, 0x08}, // F段
        {27, 0x10}, // G段
    },
    //工位2的设定时间的第三位
    {
        {25, 0x08}, // A段
        {23, 0x08}, // B段
        {23, 0x20}, // C段
        {25, 0x80}, // D段
        {25, 0x40}, // E段
        {25, 0x10}, // F段
        {23, 0x10}, // G段
    },
	//工位2的设定时间的第四位
    {
        {21, 0x02}, // A段
        {21, 0x04}, // B段
        {21, 0x20}, // C段
        {23, 0x80}, // D段
        {23, 0x40}, // E段
        {21, 0x08}, // F段
        {21, 0x10}, // G段
    },

    /* 工位3 */
    // 工位3的实际转速，第2位
    {
        {75, 0x80}, // A段: 地址54, 数据0x01
        {75, 0x40}, // B段
        {73, 0x08}, // C段
        {75, 0x08}, // D段
        {77, 0x10}, // E段
        {75, 0x20}, // F段
        {75, 0x10}, // G段
    },
    // 工位3的实际转速，第3位
    {
        {73, 0x80}, // A段
        {71, 0x80}, // B段
        {71, 0x20}, // C段
        {73, 0x10}, // D段
        {73, 0x20}, // E段
        {73, 0x40}, // F段
        {71, 0x40}, // G段
    },
    //工位3的设定速度的第二位
    {
        {67, 0x40}, // A段
        {67, 0x20}, // B段
        {67, 0x08}, // C段
        {67, 0x04}, // D段
        {69, 0x08}, // E段
        {69, 0x20}, // F段
        {69, 0x10}, // G段
    },
    //工位3的设定速度的第三位
    {
        {65, 0x80}, // A段
        {63, 0x40}, // B段
        {63, 0x20}, // C段
        {65, 0x10}, // D段
        {67, 0x10}, // E段
        {65, 0x40}, // F段
        {65, 0x20}, // G段
    },

    //工位3的实际温度的第一位
    {
        {79, 0x08}, // A段
        {79, 0x04}, // B段
        {78, 0x80}, // C段
        {78, 0x20}, // D段
        {78, 0x40}, // E段
        {79, 0x02}, // F段
        {79, 0x01}, // G段
    },
	//工位3的实际温度的第二位
    {
        {77, 0x08}, // A段
        {77, 0x04}, // B段
        {76, 0x80}, // C段
        {76, 0x20}, // D段
        {76, 0x40}, // E段
        {77, 0x02}, // F段
        {77, 0x01}, // G段
    },
    //工位3的实际温度的第三位
    {
        {75, 0x04}, // A段
        {73, 0x02}, // B段
        {73, 0x01}, // C段
        {74, 0x40}, // D段
        {74, 0x80}, // E段
        {75, 0x02}, // F段
        {75, 0x01}, // G段
    },
	//工位3的实际温度的第四位
    {
        {71, 0x10}, // A段
        {71, 0x08}, // B段
        {71, 0x02}, // C段
        {70, 0x80}, // D段
        {71, 0x01}, // E段
        {73, 0x04}, // F段
        {71, 0x04}, // G段
    },

    //工位3的设定温度的第一位
    {
        {69, 0x04}, // A段
        {67, 0x02}, // B段
        {66, 0x80}, // C段
        {68, 0x80}, // D段
        {69, 0x01}, // E段
        {69, 0x02}, // F段
        {67, 0x01}, // G段
    },
	//工位3的设定温度的第二位
    {
        {65, 0x08}, // A段
        {65, 0x04}, // B段
        {64, 0x80}, // C段
        {64, 0x20}, // D段
        {64, 0x40}, // E段
        {65, 0x02}, // F段
        {65, 0x01}, // G段
    },
    //工位3的设定温度的第三位
    {
        {63, 0x10}, // A段
        {63, 0x08}, // B段
        {63, 0x01}, // C段
        {62, 0x40}, // D段
        {62, 0x80}, // E段
        {63, 0x04}, // F段
        {63, 0x02}, // G段
    },
	//工位3的设定温度的第四位
    {
        {61, 0x20}, // A段
        {61, 0x10}, // B段
        {61, 0x02}, // C段
        {60, 0x80}, // D段
        {61, 0x01}, // E段
        {61, 0x08}, // F段
        {61, 0x04}, // G段
    },

    //工位3的实际时间的第一位
    {
        {78, 0x10}, // A段
        {76, 0x04}, // B段
        {76, 0x02}, // C段
        {76, 0x01}, // D段
        {78, 0x02}, // E段
        {78, 0x08}, // F段
        {78, 0x04}, // G段
    },
	//工位3的实际时间的第二位
    {
        {76, 0x10}, // A段
        {74, 0x10}, // B段
        {74, 0x02}, // C段
        {74, 0x01}, // D段
        {74, 0x04}, // E段
        {76, 0x08}, // F段
        {74, 0x08}, // G段
    },
    //工位3的实际时间的第三位
    {
        {72, 0x40}, // A段
        {72, 0x20}, // B段
        {72, 0x04}, // C段
        {72, 0x01}, // D段
        {72, 0x02}, // E段
        {72, 0x10}, // F段
        {72, 0x08}, // G段
    },
	//工位3的实际时间的第四位
    {
        {70, 0x40}, // A段
        {70, 0x20}, // B段
        {70, 0x04}, // C段
        {70, 0x01}, // D段
        {70, 0x02}, // E段
        {70, 0x10}, // F段
        {70, 0x08}, // G段
    },

    //工位3的设定时间的第一位
    {
        {68, 0x40}, // A段
        {68, 0x20}, // B段
        {68, 0x04}, // C段
        {68, 0x01}, // D段
        {68, 0x02}, // E段
        {68, 0x10}, // F段
        {68, 0x08}, // G段
    },
	//工位3的设定时间的第二位
    {
        {66, 0x40}, // A段
        {66, 0x20}, // B段
        {66, 0x04}, // C段
        {66, 0x01}, // D段
        {66, 0x02}, // E段
        {66, 0x10}, // F段
        {66, 0x08}, // G段
    },
    //工位3的设定时间的第三位
    {
        {64, 0x10}, // A段
        {62, 0x10}, // B段
        {62, 0x04}, // C段
        {64, 0x01}, // D段
        {64, 0x02}, // E段
        {64, 0x08}, // F段
        {62, 0x08}, // G段
    },
	//工位3的设定时间的第四位
    {
        {60, 0x40}, // A段
        {60, 0x20}, // B段
        {60, 0x04}, // C段
        {62, 0x01}, // D段
        {62, 0x02}, // E段
        {60, 0x10}, // F段
        {60, 0x08}, // G段
    },

    /* 工位4 */
    // 工位4的实际转速，第2位
    {
        {5, 0x80}, // A段: 地址54, 数据0x01
        {5, 0x40}, // B段
        {7, 0x08}, // C段
        {5, 0x08}, // D段
        {3, 0x10}, // E段
        {5, 0x20}, // F段
        {5, 0x10}, // G段
    },
    // 工位4的实际转速，第3位
    {
        {7, 0x80}, // A段
        {9, 0x80}, // B段
        {9, 0x20}, // C段
        {7, 0x10}, // D段
        {7, 0x20}, // E段
        {7, 0x40}, // F段
        {9, 0x40}, // G段
    },
    //工位4的设定速度的第二位
    {
        {13, 0x40}, // A段
        {13, 0x20}, // B段
        {13, 0x08}, // C段
        {13, 0x04}, // D段
        {11, 0x08}, // E段
        {11, 0x20}, // F段
        {11, 0x10}, // G段
    },
    //工位4的设定速度的第三位
    {
        {15, 0x80}, // A段
        {17, 0x40}, // B段
        {17, 0x20}, // C段
        {15, 0x10}, // D段
        {13, 0x10}, // E段
        {15, 0x40}, // F段
        {15, 0x20}, // G段
    },

    //工位4的实际温度的第一位
    {
        {1, 0x08}, // A段
        {1, 0x04}, // B段
        {0, 0x80}, // C段
        {0, 0x20}, // D段
        {0, 0x40}, // E段
        {1, 0x02}, // F段
        {1, 0x01}, // G段
    },
	//工位4的实际温度的第二位
    {
        {3, 0x08}, // A段
        {3, 0x04}, // B段
        {2, 0x80}, // C段
        {2, 0x20}, // D段
        {2, 0x40}, // E段
        {3, 0x02}, // F段
        {3, 0x01}, // G段
    },
    //工位4的实际温度的第三位
    {
        {5, 0x04}, // A段
        {7, 0x02}, // B段
        {7, 0x01}, // C段
        {4, 0x40}, // D段
        {4, 0x80}, // E段
        {5, 0x02}, // F段
        {5, 0x01}, // G段
    },
	//工位4的实际温度的第四位
    {
        {9, 0x10}, // A段
        {9, 0x08}, // B段
        {9, 0x02}, // C段
        {8, 0x80}, // D段
        {9, 0x01}, // E段
        {7, 0x04}, // F段
        {9, 0x04}, // G段
    },

    //工位4的设定温度的第一位
    {
        {11, 0x04}, // A段
        {13, 0x02}, // B段
        {12, 0x80}, // C段
        {10, 0x80}, // D段
        {11, 0x01}, // E段
        {11, 0x02}, // F段
        {13, 0x01}, // G段
    },
	//工位4的设定温度的第二位
    {
        {15, 0x08}, // A段
        {15, 0x04}, // B段
        {14, 0x80}, // C段
        {14, 0x20}, // D段
        {14, 0x40}, // E段
        {15, 0x02}, // F段
        {15, 0x01}, // G段
    },
    //工位4的设定温度的第三位
    {
        {17, 0x10}, // A段
        {17, 0x08}, // B段
        {17, 0x01}, // C段
        {16, 0x40}, // D段
        {16, 0x80}, // E段
        {17, 0x04}, // F段
        {17, 0x02}, // G段
    },
	//工位4的设定温度的第四位
    {
        {19, 0x20}, // A段
        {19, 0x10}, // B段
        {19, 0x02}, // C段
        {18, 0x80}, // D段
        {19, 0x01}, // E段
        {19, 0x08}, // F段
        {19, 0x04}, // G段
    },

    //工位4的实际时间的第一位
    {
        {0, 0x10}, // A段
        {2, 0x04}, // B段
        {2, 0x02}, // C段
        {2, 0x01}, // D段
        {0, 0x02}, // E段
        {0, 0x08}, // F段
        {0, 0x04}, // G段
    },
	//工位4的实际时间的第二位
    {
        {2, 0x10}, // A段
        {4, 0x10}, // B段
        {4, 0x02}, // C段
        {4, 0x01}, // D段
        {4, 0x04}, // E段
        {2, 0x08}, // F段
        {4, 0x08}, // G段
    },
    //工位4的实际时间的第三位
    {
        {6, 0x40}, // A段
        {6, 0x20}, // B段
        {6, 0x04}, // C段
        {6, 0x01}, // D段
        {6, 0x02}, // E段
        {6, 0x10}, // F段
        {6, 0x08}, // G段
    },
	//工位4的实际时间的第四位
    {
        {8, 0x40}, // A段
        {8, 0x20}, // B段
        {8, 0x04}, // C段
        {8, 0x01}, // D段
        {8, 0x02}, // E段
        {8, 0x10}, // F段
        {8, 0x08}, // G段
    },

    //工位4的设定时间的第一位
    {
        {10, 0x40}, // A段
        {10, 0x20}, // B段
        {10, 0x04}, // C段
        {10, 0x01}, // D段
        {10, 0x02}, // E段
        {10, 0x10}, // F段
        {10, 0x08}, // G段
    },
	//工位4的设定时间的第二位
    {
        {12, 0x40}, // A段
        {12, 0x20}, // B段
        {12, 0x04}, // C段
        {12, 0x01}, // D段
        {12, 0x02}, // E段
        {12, 0x10}, // F段
        {12, 0x08}, // G段
    },
    //工位4的设定时间的第三位
    {
        {14, 0x10}, // A段
        {16, 0x10}, // B段
        {16, 0x04}, // C段
        {14, 0x01}, // D段
        {14, 0x02}, // E段
        {14, 0x08}, // F段
        {16, 0x08}, // G段
    },
	//工位4的设定时间的第四位
    {
        {18, 0x40}, // A段
        {18, 0x20}, // B段
        {18, 0x04}, // C段
        {16, 0x01}, // D段
        {16, 0x02}, // E段
        {18, 0x10}, // F段
        {18, 0x08}, // G段
    },

    /* 工位5 */
    // 工位5的实际转速，第2位
    {
        {84, 0x01}, // A段: 地址54, 数据0x01
        {84, 0x02}, // B段
        {86, 0x10}, // C段
        {84, 0x10}, // D段
        {82, 0x08}, // E段
        {84, 0x04}, // F段
        {84, 0x08}, // G段
    },
    // 工位5的实际转速，第3位
    {
        {86, 0x01}, // A段
        {88, 0x01}, // B段
        {88, 0x04}, // C段
        {86, 0x08}, // D段
        {86, 0x04}, // E段
        {86, 0x02}, // F段
        {88, 0x02}, // G段
    },
    //工位5的设定速度的第二位
    {
        {92, 0x02}, // A段
        {92, 0x04}, // B段
        {92, 0x10}, // C段
        {92, 0x20}, // D段
        {90, 0x10}, // E段
        {90, 0x04}, // F段
        {90, 0x08}, // G段
    },
    //工位5的设定速度的第三位
    {
        {94, 0x01}, // A段
        {96, 0x02}, // B段
        {96, 0x04}, // C段
        {94, 0x08}, // D段
        {92, 0x08}, // E段
        {94, 0x02}, // F段
        {94, 0x04}, // G段
    },

    //工位5的实际温度的第一位
    {
        {80, 0x10}, // A段
        {80, 0x20}, // B段
        {81, 0x01}, // C段
        {81, 0x04}, // D段
        {81, 0x02}, // E段
        {80, 0x40}, // F段
        {80, 0x80}, // G段
    },
	//工位5的实际温度的第二位
    {
        {82, 0x10}, // A段
        {82, 0x20}, // B段
        {83, 0x01}, // C段
        {83, 0x04}, // D段
        {83, 0x02}, // E段
        {82, 0x40}, // F段
        {82, 0x80}, // G段
    },
    //工位5的实际温度的第三位
    {
        {84, 0x20}, // A段
        {86, 0x40}, // B段
        {86, 0x80}, // C段
        {85, 0x02}, // D段
        {85, 0x01}, // E段
        {84, 0x40}, // F段
        {84, 0x80}, // G段
    },
	//工位5的实际温度的第四位
    {
        {88, 0x08}, // A段
        {88, 0x10}, // B段
        {88, 0x40}, // C段
        {89, 0x01}, // D段
        {88, 0x80}, // E段
        {86, 0x20}, // F段
        {88, 0x20}, // G段
    },

    //工位5的设定温度的第一位
    {
        {90, 0x20}, // A段
        {92, 0x40}, // B段
        {93, 0x01}, // C段
        {91, 0x01}, // D段
        {90, 0x80}, // E段
        {90, 0x40}, // F段
        {92, 0x80}, // G段
    },
	//工位5的设定温度的第二位
    {
        {94, 0x10}, // A段
        {94, 0x20}, // B段
        {95, 0x01}, // C段
        {95, 0x04}, // D段
        {95, 0x02}, // E段
        {94, 0x40}, // F段
        {94, 0x80}, // G段
    },
    //工位5的设定温度的第三位
    {
        {96, 0x08}, // A段
        {96, 0x10}, // B段
        {96, 0x80}, // C段
        {97, 0x02}, // D段
        {97, 0x01}, // E段
        {96, 0x20}, // F段
        {96, 0x40}, // G段
    },
	//工位5的设定温度的第四位
    {
        {98, 0x04}, // A段
        {98, 0x08}, // B段
        {98, 0x40}, // C段
        {99, 0x01}, // D段
        {98, 0x80}, // E段
        {98, 0x10}, // F段
        {98, 0x20}, // G段
    },

    //工位5的实际时间的第一位
    {
        {81, 0x08}, // A段
        {83, 0x20}, // B段
        {83, 0x40}, // C段
        {83, 0x80}, // D段
        {81, 0x40}, // E段
        {81, 0x10}, // F段
        {81, 0x20}, // G段
    },
	//工位5的实际时间的第二位
    {
        {83, 0x08}, // A段
        {85, 0x08}, // B段
        {85, 0x40}, // C段
        {85, 0x80}, // D段
        {85, 0x20}, // E段
        {83, 0x10}, // F段
        {85, 0x10}, // G段
    },
    //工位5的实际时间的第三位
    {
        {87, 0x02}, // A段
        {87, 0x04}, // B段
        {87, 0x20}, // C段
        {87, 0x80}, // D段
        {87, 0x40}, // E段
        {87, 0x08}, // F段
        {87, 0x10}, // G段
    },
	//工位5的实际时间的第四位
    {
        {89, 0x02}, // A段
        {89, 0x04}, // B段
        {89, 0x20}, // C段
        {89, 0x80}, // D段
        {89, 0x40}, // E段
        {89, 0x08}, // F段
        {89, 0x10}, // G段
    },

    //工位5的设定时间的第一位
    {
        {91, 0x02}, // A段
        {91, 0x04}, // B段
        {91, 0x20}, // C段
        {91, 0x80}, // D段
        {91, 0x40}, // E段
        {91, 0x08}, // F段
        {91, 0x10}, // G段
    },
	//工位5的设定时间的第二位
    {
        {93, 0x02}, // A段
        {93, 0x04}, // B段
        {93, 0x20}, // C段
        {93, 0x80}, // D段
        {93, 0x40}, // E段
        {93, 0x08}, // F段
        {93, 0x10}, // G段
    },

    //工位5的设定时间的第三位
    {
        {95, 0x08}, // A段
        {97, 0x08}, // B段
        {97, 0x20}, // C段
        {95, 0x80}, // D段
        {95, 0x40}, // E段
        {95, 0x10}, // F段
        {97, 0x10}, // G段
    },
	//工位5的设定时间的第四位
    {
        {99, 0x02}, // A段
        {99, 0x04}, // B段
        {99, 0x20}, // C段
        {97, 0x80}, // D段
        {97, 0x40}, // E段
        {99, 0x08}, // F段
        {99, 0x10}, // G段
    },

    /* 工位6 */
    // 工位6的实际转速，第2位
    {
        {104, 0x01}, // A段: 地址54, 数据0x01
        {104, 0x02}, // B段
        {106, 0x10}, // C段
        {104, 0x10}, // D段
        {102, 0x08}, // E段
        {104, 0x04}, // F段
        {104, 0x08}, // G段
    },
    // 工位6的实际转速，第3位
    {
        {106, 0x01}, // A段
        {108, 0x01}, // B段
        {108, 0x04}, // C段
        {106, 0x08}, // D段
        {106, 0x04}, // E段
        {106, 0x02}, // F段
        {108, 0x02}, // G段
    },
    //工位6的设定速度的第二位
    {
        {112, 0x02}, // A段
        {112, 0x04}, // B段
        {112, 0x10}, // C段
        {112, 0x20}, // D段
        {110, 0x10}, // E段
        {110, 0x04}, // F段
        {110, 0x08}, // G段
    },
    //工位6的设定速度的第三位
    {
        {114, 0x01}, // A段
        {116, 0x02}, // B段
        {116, 0x04}, // C段
        {114, 0x08}, // D段
        {112, 0x08}, // E段
        {114, 0x02}, // F段
        {114, 0x04}, // G段
    },

    //工位6的实际温度的第一位
    {
        {100, 0x10}, // A段
        {100, 0x20}, // B段
        {101, 0x01}, // C段
        {101, 0x04}, // D段
        {101, 0x02}, // E段
        {100, 0x40}, // F段
        {100, 0x80}, // G段
    },
	//工位6的实际温度的第二位
    {
        {102, 0x10}, // A段
        {102, 0x20}, // B段
        {103, 0x01}, // C段
        {103, 0x04}, // D段
        {103, 0x02}, // E段
        {102, 0x40}, // F段
        {102, 0x80}, // G段
    },
    //工位6的实际温度的第三位
    {
        {104, 0x20}, // A段
        {106, 0x40}, // B段
        {106, 0x80}, // C段
        {105, 0x02}, // D段
        {105, 0x01}, // E段
        {104, 0x40}, // F段
        {104, 0x80}, // G段
    },
	//工位6的实际温度的第四位
    {
        {108, 0x08}, // A段
        {108, 0x10}, // B段
        {108, 0x40}, // C段
        {109, 0x01}, // D段
        {108, 0x80}, // E段
        {106, 0x20}, // F段
        {108, 0x20}, // G段
    },

    //工位6的设定温度的第一位
    {
        {110, 0x20}, // A段
        {112, 0x40}, // B段
        {113, 0x01}, // C段
        {111, 0x01}, // D段
        {110, 0x80}, // E段
        {110, 0x40}, // F段
        {112, 0x80}, // G段
    },
	//工位6的设定温度的第二位
    {
        {114, 0x10}, // A段
        {114, 0x20}, // B段
        {115, 0x01}, // C段
        {115, 0x04}, // D段
        {115, 0x02}, // E段
        {114, 0x40}, // F段
        {114, 0x80}, // G段
    },
    //工位6的设定温度的第三位
    {
        {116, 0x08}, // A段
        {116, 0x10}, // B段
        {116, 0x80}, // C段
        {117, 0x02}, // D段
        {117, 0x01}, // E段
        {116, 0x20}, // F段
        {116, 0x40}, // G段
    },
	//工位6的设定温度的第四位
    {
        {118, 0x04}, // A段
        {118, 0x08}, // B段
        {118, 0x40}, // C段
        {119, 0x01}, // D段
        {118, 0x80}, // E段
        {118, 0x10}, // F段
        {118, 0x20}, // G段
    },

    //工位6的实际时间的第一位
    {
        {101, 0x08}, // A段
        {103, 0x20}, // B段
        {103, 0x40}, // C段
        {103, 0x80}, // D段
        {101, 0x40}, // E段
        {101, 0x10}, // F段
        {101, 0x20}, // G段
    },
	//工位6的实际时间的第二位
    {
        {103, 0x08}, // A段
        {105, 0x08}, // B段
        {105, 0x40}, // C段
        {105, 0x80}, // D段
        {105, 0x20}, // E段
        {103, 0x10}, // F段
        {105, 0x10}, // G段
    },
    //工位6的实际时间的第三位
    {
        {107, 0x02}, // A段
        {107, 0x04}, // B段
        {107, 0x20}, // C段
        {107, 0x80}, // D段
        {107, 0x40}, // E段
        {107, 0x08}, // F段
        {107, 0x10}, // G段
    },
	//工位6的实际时间的第四位
    {
        {109, 0x02}, // A段
        {109, 0x04}, // B段
        {109, 0x20}, // C段
        {109, 0x80}, // D段
        {109, 0x40}, // E段
        {109, 0x08}, // F段
        {109, 0x10}, // G段
    },

    //工位6的设定时间的第一位
    {
        {111, 0x02}, // A段
        {111, 0x04}, // B段
        {111, 0x20}, // C段
        {111, 0x80}, // D段
        {111, 0x40}, // E段
        {111, 0x08}, // F段
        {111, 0x10}, // G段
    },
	//工位6的设定时间的第二位
    {
        {113, 0x02}, // A段
        {113, 0x04}, // B段
        {113, 0x20}, // C段
        {113, 0x80}, // D段
        {113, 0x40}, // E段
        {113, 0x08}, // F段
        {113, 0x10}, // G段
    },

    //工位6的设定时间的第三位
    {
        {115, 0x08}, // A段
        {117, 0x08}, // B段
        {117, 0x20}, // C段
        {115, 0x80}, // D段
        {115, 0x40}, // E段
        {115, 0x10}, // F段
        {117, 0x10}, // G段
    },
	//工位6的设定时间的第四位
    {
        {119, 0x02}, // A段
        {119, 0x04}, // B段
        {119, 0x20}, // C段
        {117, 0x80}, // D段
        {117, 0x40}, // E段
        {119, 0x08}, // F段
        {119, 0x10}, // G段
    },
};

/**
 * @brief 位数计算
 *
 * @param *bit 输入的位数
 * @param num 与等于的数
 * @param num1 或等于的数
 */
void bit_Cal(uint8_t bit,uint8_t num,uint8_t num1)
{
    seg[bit] &= (0xFF-num);seg[bit] |= num1;
}

/**
 * @brief 显示一个数字
 * 
 * @param Loc 显示的位置
 * @param number 要显示的数字(0-9)或者其他常用字符
 */
void ShowDigit(uint8_t Loc,uint8_t number) 
{
	for (uint8_t segIdx = 0; segIdx < SEG_COUNT; segIdx++) 
	{
        SegmentMapping mapping = DigitSegmentMap[Loc][segIdx];
		if(SegmentCodes[number] & Bit_Comparison[segIdx])
		{
			bit_Cal(mapping.address,mapping.value,mapping.value);
		}
		else
		{
			bit_Cal(mapping.address,mapping.value,0x00);
		}
    }
}
