#include "LCDFont.h"

uint8_t seg[Seg_Buff_Size] = {0};//存储显示数据

/* 定义数字和一些常用的字母之类的断码组合 */
const uint8_t SegmentCodes[19] = {
    0x3F, // 0 - ABCDEF
    0x06, // 1 - BC
    0x5B, // 2 - ABGED
    0x4F, // 3 - ABGCD
    0x66, // 4 - FBGC
    0x6D, // 5 - AFGCD
    0x7D, // 6 - AFGECD
    0x07, // 7 - ABC
    0x7F, // 8 - ABCDEFG
    0x6F, // 9 - ABCDFG
	0x40, // - - G
	0x77, // A - ABCEFG
	0x7C, // B - CDEFG
	0x39, // C - ADEF
	0x5E, // D - BCDEG
	0x79, // E - ADEFG
	0x71, // F - AEFG
	0x3D, // G - ACDEF
    0x00 //不显示
};

/* 定义数字和一些常用的字母之类的断码组合 */
uint8_t Bit_Comparison[SEG_COUNT] = 
{
	0x01,
	0x02,
	0x04,
	0x08,
	0x10,
	0x20,
	0x40,
};

/* 每位数字断码的seg状态分布 */
SegmentMapping DigitSegmentMap[Location_COUNT][SEG_COUNT] = {
    /* 工位1 */
    // 工位1的实际转速，第2位
    {
        {54, 0x01}, // A段: 地址54, 数据0x01
        {54, 0x02}, // B段
        {52, 0x10}, // C段
        {54, 0x10}, // D段
        {56, 0x08}, // E段
        {54, 0x04}, // F段
        {54, 0x08}, // G段
    },
    // 工位1的实际转速，第3位
    {
        {52, 0x01}, // A段
        {50, 0x01}, // B段
        {50, 0x04}, // C段
        {52, 0x08}, // D段
        {52, 0x04}, // E段
        {52, 0x02}, // F段
        {50, 0x08}, // G段
    },
    //工位1的设定速度的第二位
    {
        {46, 0x02}, // A段
        {46, 0x04}, // B段
        {46, 0x10}, // C段
        {46, 0x20}, // D段
        {48, 0x10}, // E段
        {48, 0x04}, // F段
        {48, 0x08}, // G段
    },
    //工位1的设定速度的第三位
    {
        {44, 0x01}, // A段
        {42, 0x02}, // B段
        {42, 0x04}, // C段
        {44, 0x08}, // D段
        {46, 0x08}, // E段
        {44, 0x10}, // F段
        {44, 0x04}, // G段
    },

    //工位1的实际温度的第一位
    {
        {58, 0x10}, // A段
        {58, 0x20}, // B段
        {59, 0x01}, // C段
        {59, 0x04}, // D段
        {59, 0x02}, // E段
        {58, 0x40}, // F段
        {58, 0x80}, // G段
    },
	//工位1的实际温度的第二位
    {
        {56, 0x10}, // A段
        {56, 0x20}, // B段
        {57, 0x01}, // C段
        {57, 0x04}, // D段
        {57, 0x02}, // E段
        {56, 0x40}, // F段
        {56, 0x80}, // G段
    },
    //工位1的实际温度的第三位
    {
        {54, 0x20}, // A段
        {52, 0x40}, // B段
        {52, 0x80}, // C段
        {55, 0x02}, // D段
        {55, 0x01}, // E段
        {54, 0x40}, // F段
        {54, 0x80}, // G段
    },
	//工位1的实际温度的第四位
    {
        {50, 0x08}, // A段
        {50, 0x10}, // B段
        {50, 0x40}, // C段
        {51, 0x01}, // D段
        {50, 0x80}, // E段
        {52, 0x20}, // F段
        {50, 0x20}, // G段
    },

    //工位1的设定温度的第一位
    {
        {48, 0x20}, // A段
        {46, 0x40}, // B段
        {47, 0x01}, // C段
        {49, 0x01}, // D段
        {48, 0x80}, // E段
        {48, 0x40}, // F段
        {46, 0x80}, // G段
    },
	//工位1的设定温度的第二位
    {
        {44, 0x10}, // A段
        {44, 0x20}, // B段
        {45, 0x01}, // C段
        {45, 0x04}, // D段
        {45, 0x02}, // E段
        {44, 0x40}, // F段
        {44, 0x80}, // G段
    },
    //工位1的设定温度的第三位
    {
        {42, 0x08}, // A段
        {42, 0x10}, // B段
        {42, 0x80}, // C段
        {43, 0x02}, // D段
        {43, 0x01}, // E段
        {42, 0x20}, // F段
        {42, 0x40}, // G段
    },
	//工位1的设定温度的第四位
    {
        {40, 0x04}, // A段
        {40, 0x10}, // B段
        {40, 0x40}, // C段
        {41, 0x01}, // D段
        {40, 0x80}, // E段
        {40, 0x10}, // F段
        {40, 0x20}, // G段
    },

    //工位1的实际时间的第一位
    {
        {59, 0x08}, // A段
        {57, 0x20}, // B段
        {57, 0x40}, // C段
        {57, 0x80}, // D段
        {59, 0x40}, // E段
        {59, 0x10}, // F段
        {59, 0x20}, // G段
    },
	//工位1的实际时间的第二位
    {
        {57, 0x08}, // A段
        {55, 0x08}, // B段
        {55, 0x40}, // C段
        {55, 0x80}, // D段
        {55, 0x20}, // E段
        {57, 0x10}, // F段
        {55, 0x10}, // G段
    },
    //工位1的实际时间的第三位
    {
        {53, 0x02}, // A段
        {53, 0x04}, // B段
        {53, 0x20}, // C段
        {53, 0x80}, // D段
        {53, 0x40}, // E段
        {53, 0x08}, // F段
        {53, 0x10}, // G段
    },
	//工位1的实际时间的第四位
    {
        {51, 0x02}, // A段
        {51, 0x04}, // B段
        {51, 0x20}, // C段
        {51, 0x80}, // D段
        {51, 0x40}, // E段
        {51, 0x08}, // F段
        {51, 0x10}, // G段
    },

    //工位1的设定时间的第一位
    {
        {49, 0x02}, // A段
        {49, 0x04}, // B段
        {49, 0x20}, // C段
        {49, 0x80}, // D段
        {49, 0x40}, // E段
        {49, 0x08}, // F段
        {49, 0x10}, // G段
    },
	//工位1的设定时间的第二位
    {
        {47, 0x02}, // A段
        {47, 0x04}, // B段
        {47, 0x20}, // C段
        {47, 0x80}, // D段
        {47, 0x40}, // E段
        {47, 0x08}, // F段
        {47, 0x10}, // G段
    },
    //工位1的设定时间的第三位
    {
        {45, 0x08}, // A段
        {43, 0x08}, // B段
        {43, 0x20}, // C段
        {45, 0x80}, // D段
        {45, 0x40}, // E段
        {45, 0x10}, // F段
        {43, 0x10}, // G段
    },
	//工位1的设定时间的第四位
    {
        {41, 0x02}, // A段
        {41, 0x04}, // B段
        {41, 0x20}, // C段
        {43, 0x80}, // D段
        {43, 0x40}, // E段
        {41, 0x08}, // F段
        {41, 0x10}, // G段
    },

    /* 工位2 */
    // 工位2的实际转速，第2位
    {
        {34, 0x01}, // A段: 地址54, 数据0x01
        {34, 0x02}, // B段
        {32, 0x10}, // C段
        {34, 0x10}, // D段
        {36, 0x08}, // E段
        {34, 0x04}, // F段
        {34, 0x08}, // G段
    },
    // 工位2的实际转速，第3位
    {
        {32, 0x01}, // A段
        {30, 0x01}, // B段
        {30, 0x04}, // C段
        {32, 0x08}, // D段
        {32, 0x04}, // E段
        {32, 0x02}, // F段
        {30, 0x08}, // G段
    },
    //工位2的设定速度的第二位
    {
        {26, 0x02}, // A段
        {26, 0x04}, // B段
        {26, 0x10}, // C段
        {26, 0x20}, // D段
        {28, 0x10}, // E段
        {28, 0x04}, // F段
        {28, 0x08}, // G段
    },
    //工位2的设定速度的第三位
    {
        {24, 0x01}, // A段
        {22, 0x02}, // B段
        {22, 0x04}, // C段
        {24, 0x08}, // D段
        {26, 0x08}, // E段
        {24, 0x10}, // F段
        {24, 0x04}, // G段
    },

    //工位2的实际温度的第一位
    {
        {38, 0x10}, // A段
        {38, 0x20}, // B段
        {39, 0x01}, // C段
        {39, 0x04}, // D段
        {39, 0x02}, // E段
        {38, 0x40}, // F段
        {38, 0x80}, // G段
    },
	//工位2的实际温度的第二位
    {
        {36, 0x10}, // A段
        {36, 0x20}, // B段
        {37, 0x01}, // C段
        {37, 0x04}, // D段
        {37, 0x02}, // E段
        {36, 0x40}, // F段
        {36, 0x80}, // G段
    },
    //工位2的实际温度的第三位
    {
        {34, 0x20}, // A段
        {32, 0x40}, // B段
        {32, 0x80}, // C段
        {35, 0x02}, // D段
        {35, 0x01}, // E段
        {34, 0x40}, // F段
        {34, 0x80}, // G段
    },
	//工位2的实际温度的第四位
    {
        {30, 0x08}, // A段
        {30, 0x10}, // B段
        {30, 0x40}, // C段
        {31, 0x01}, // D段
        {30, 0x80}, // E段
        {32, 0x20}, // F段
        {30, 0x20}, // G段
    },

    //工位2的设定温度的第一位
    {
        {28, 0x20}, // A段
        {26, 0x40}, // B段
        {27, 0x01}, // C段
        {29, 0x01}, // D段
        {28, 0x80}, // E段
        {28, 0x40}, // F段
        {26, 0x80}, // G段
    },
	//工位2的设定温度的第二位
    {
        {24, 0x10}, // A段
        {24, 0x20}, // B段
        {25, 0x01}, // C段
        {25, 0x04}, // D段
        {25, 0x02}, // E段
        {24, 0x40}, // F段
        {24, 0x80}, // G段
    },
    //工位2的设定温度的第三位
    {
        {22, 0x08}, // A段
        {22, 0x10}, // B段
        {22, 0x80}, // C段
        {23, 0x02}, // D段
        {23, 0x01}, // E段
        {22, 0x20}, // F段
        {22, 0x40}, // G段
    },
	//工位2的设定温度的第四位
    {
        {20, 0x04}, // A段
        {20, 0x10}, // B段
        {20, 0x40}, // C段
        {21, 0x01}, // D段
        {20, 0x80}, // E段
        {20, 0x10}, // F段
        {20, 0x20}, // G段
    },

    //工位2的实际时间的第一位
    {
        {39, 0x08}, // A段
        {37, 0x20}, // B段
        {37, 0x40}, // C段
        {37, 0x80}, // D段
        {39, 0x40}, // E段
        {39, 0x10}, // F段
        {39, 0x20}, // G段
    },
	//工位2的实际时间的第二位
    {
        {37, 0x08}, // A段
        {35, 0x08}, // B段
        {35, 0x40}, // C段
        {35, 0x80}, // D段
        {35, 0x20}, // E段
        {37, 0x10}, // F段
        {35, 0x10}, // G段
    },
    //工位2的实际时间的第三位
    {
        {33, 0x02}, // A段
        {33, 0x04}, // B段
        {33, 0x20}, // C段
        {33, 0x80}, // D段
        {33, 0x40}, // E段
        {33, 0x08}, // F段
        {33, 0x10}, // G段
    },
	//工位2的实际时间的第四位
    {
        {31, 0x02}, // A段
        {31, 0x04}, // B段
        {31, 0x20}, // C段
        {31, 0x80}, // D段
        {31, 0x40}, // E段
        {31, 0x08}, // F段
        {31, 0x10}, // G段
    },

    //工位2的设定时间的第一位
    {
        {29, 0x02}, // A段
        {29, 0x04}, // B段
        {29, 0x20}, // C段
        {29, 0x80}, // D段
        {29, 0x40}, // E段
        {29, 0x08}, // F段
        {29, 0x10}, // G段
    },
	//工位2的设定时间的第二位
    {
        {27, 0x02}, // A段
        {27, 0x04}, // B段
        {27, 0x20}, // C段
        {27, 0x80}, // D段
        {27, 0x40}, // E段
        {27, 0x08}, // F段
        {27, 0x10}, // G段
    },
    //工位2的设定时间的第三位
    {
        {25, 0x08}, // A段
        {23, 0x08}, // B段
        {23, 0x20}, // C段
        {25, 0x80}, // D段
        {25, 0x40}, // E段
        {25, 0x10}, // F段
        {23, 0x10}, // G段
    },
	//工位2的设定时间的第四位
    {
        {21, 0x02}, // A段
        {21, 0x04}, // B段
        {21, 0x20}, // C段
        {23, 0x80}, // D段
        {23, 0x40}, // E段
        {21, 0x08}, // F段
        {21, 0x10}, // G段
    },
};

/**
 * @brief 位数计算
 *
 * @param *bit 输入的位数
 * @param num 与等于的数
 * @param num1 或等于的数
 */
void bit_Cal(uint8_t bit,uint8_t num,uint8_t num1)
{
    seg[bit] &= (0xFF-num);seg[bit] |= num1;
}

/**
 * @brief 显示一个数字
 * 
 * @param Loc 显示的位置
 * @param number 要显示的数字(0-9)或者其他常用字符
 */
void ShowDigit(uint8_t Loc,uint8_t number) 
{
	for (uint8_t segIdx = 0; segIdx < SEG_COUNT; segIdx++) 
	{
        SegmentMapping mapping = DigitSegmentMap[Loc][segIdx];
		if(SegmentCodes[number] & Bit_Comparison[segIdx])
		{
			bit_Cal(mapping.address,mapping.value,mapping.value);
		}
		else
		{
			bit_Cal(mapping.address,mapping.value,0x00);
		}
    }
}
