#include "System_Init.h"

/*
*****************************************************************
 * 函数原型： void System_Init(void)
 * 功    能： 系统功能初始化
*****************************************************************
*/
void System_Init(void)
{
	/**********系统初始化成功**********/
	sys.Init_ok = 0;
	
	/**********EC11A初始化定时器*******/
	EC11A_Init();

	/**********参数初始化**************/
    Param_Read();//读取参数
	
    /**********加热模块pem控制**********/
	#if(Integration_TYPE == 0)//设置成四联和六联时
        HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_4);
	#endif
	
    /**********电机初始化**********/
    Motor_Init();
    
    /**********编码器初始化**********/
    Encoder_Init();
    
    /**********初始化lcd屏幕**********/
	Lcd_Init();
    
	/**********PID初始化***************/
    PID_Init();
	
	/**********蜂鸣器响0.1S************/
    Beep_Time = 0.1;

	/***************系统初始化成功**********/
	sys.Init_ok = 1;
}
