#include "Ntc.h"

/**********局部变量**********/
const uint16_t R10K_TAB[] = //R25=10K?3% B25/50=4100K?3% 10K??//-20-105
{
    170,//-10
    180,//-9
    189,//-8
    200,//-7
    210,//-6
    221,//-5
    233,//-4
    245,//-3
    258,//-2
    271,//-1
    284,//0
    298,//1
    313,//2
    328,//3
    344,//4
    361,//5
    378,//6
    395,//7
    413,//8
    432,//9
    452,//10
    472,//11
    493,//12
    514,//13
    540,//14
    576,//15
    598,//16
    628,//17
    649,//18
    679,//19
    710,//20
    736,//21
    761,//22
    792,//23
    823,//24
    855,//25
    887,//26
    917,//27
    954,//28
    988,//29
    1026,//30
    1057,//31
    1090,//32
    1129,//33
    1164,//34
    1203,//35
    1266,//36
    1306,//37
    1342,//38
    1375,//39
    1397,//40
    1436,//41
    1475,//42
    1513,//43
    1554,//44
    1595,//45
    1631,//46
    1675,//47
    1712,//48
    1757,//49
    1795,//50
    1829,//51
    1870,//52
    1907,//53
    1946,//54
    1992,//55
    2032,//56
    2069,//57
    2107,//58
    2144,//59
    2176,//60
    2216,//61
    2253,//62
    2290,//63
    2328,//64
    2364,//65
    2393,//66
    2430,//67
    2468,//68
    2506,//69
    2531,//70
    2563,//71
    2600,//72
    2630,//73
    2662,//74
    2686,//75
    2718,//76
    2750,//77
    2778,//78
    2812,//79
    2838,//80
    2863,//81
    2893,//82
    2916,//83
    2942,//84
    2966,//85
    2996,//86
    3019,//87
    3042,//88
    3064,//89
    3087,//90
    3108,//91
    3130,//92
    3150,//93
    3172,//94
    3190,//95
    3212,//96
    3232,//97
    3248,//98
    3268,//99
    3285,//100
    3302,//101
    3320,//102
    3339,//103
    3352,//104
    3368,//105
    3386,//106
    3420,//107
    3442,//108
    3458,//109
    3473,//110
    3489,//111
    3503,//112
    3518,//113
    3532,//114
    3545,//115
    3559,//116
    3572,//117
    3585,//118
    3597,//119
    3609,//120
    3621,//121
    3632,//122
    3643,//123
    3654,//124
    3665,//125
    3675,//126
    3685,//127
    3695,//128
    3705,//129
    3714,//130
};

/**********全局变量**********/
int rel_temp;//实际温度
int set_temp;//设定温度
int ctrl_temp;//设定温度
uint16_t val;//adc的值
uint8_t res;//温度采样返回的状态

/*
*****************************************************************
 * 函数原型： int filter(void)
 * 功    能： 滑动平均值滤波
 * 输    出： 滤波后的值
*****************************************************************
*/
#define N 100//采集100次
int value_buf[N];//用于储存采集到的adc值
int i = 0;
int filter(void)
{
    char count;
    long sum = 0;

    HAL_ADC_Start(&hadc);//开始读取adc的值
    value_buf[i++] = HAL_ADC_GetValue(&hadc);//将adc的值储存
    if (i == N)//加入读了100组就从新开始
    {
        i = 0;
    }
    for (count = 0; count < N; count++)
    {
        sum += value_buf[count];//100组相加
    }
    if(value_buf[99] == 0)//如果没有读到100组就用第一次读到的数
        return value_buf[0];
    else//读到100组后
        return (int)(sum / N);//输出平均值
}

/*
*****************************************************************
 * 函数原型： uint16_t func_get_ntc_temp(uint16_t value_adc)
 * 功    能： 计算出Ntc的温度
 * 输    入:  value_adc:adc读到的值
 * 参    数： uint16_t value_adc
*****************************************************************
*/
#define SHORT_CIRCUIT_THRESHOLD 15
#define OPEN_CIRCUIT_THRESHOLD 4096
uint8_t index_l, index_r ; 
int temp = 0;
uint16_t func_get_ntc_temp(uint16_t value_adc)
{
    uint8_t r10k_tab_size = 141;
   
    if(value_adc <= SHORT_CIRCUIT_THRESHOLD)
    {
        return 1;
    }
    else if(value_adc >= OPEN_CIRCUIT_THRESHOLD)
    {
        return 2;
    }
    else if(value_adc < R10K_TAB[0])
    {
        return 3;
    }

    else if(value_adc > R10K_TAB[r10k_tab_size - 1])
    {
        return 4;
    }

    index_l = 0;
    index_r = r10k_tab_size - 1;
    for(; index_r - index_l > 1;)
    {
        if((value_adc <= R10K_TAB[index_r]) && (value_adc > R10K_TAB[(index_l + index_r) % 2 == 0 ? (index_l + index_r) / 2 : (index_l + index_r) / 2 ]))
        {
            index_l = (index_l + index_r) % 2 == 0 ? (index_l + index_r) / 2 : (index_l + index_r) / 2 ;
        }
        else
        {
            index_r = (index_l + index_r) / 2;
        }
    }
    if(R10K_TAB[index_l] == value_adc)
    {
        temp = (((int)index_l) - 10) * 10; //rate *10
    }
    else if(R10K_TAB[index_r] == value_adc)
    {
        temp = (((int)index_r) - 10) * 10; //rate *10
    }
    else
    {
        if(R10K_TAB[index_r] - R10K_TAB[index_l] == 0)
        {
			
            temp = (((int)index_l) - 10) * 10; //rate *10
        }
        else
        {
            temp = (((int)index_l) - 10) * 10 + ((value_adc - R10K_TAB[index_l] ) * 100 + 5) / 10 / (R10K_TAB[index_r] - R10K_TAB[index_l]);
        }
    }

/******************温度补偿*********************/
	rel_temp = temp - 6;//实际温度等于测得温度

	return 0;
}

/*
*****************************************************************
 * 函数原型：uint16_t Get_ADCVal(int16_t temp)
 * 功    能：计算当前温度的adc值
 * 输    入：temp：当前温度
 * 输    出：ADC值
 * 参    数：uint16_t temp
*****************************************************************
*/
uint16_t Get_ADCVal(int16_t temp)
{
	int16_t adc,adc1;
	float val2;
	int16_t val3,val1;
	
	val3 = ((temp+6)/10)+10;
	val2 = (float)((temp+6)%10)/10;
	
	val1 = (((temp+6)+10)/10)+10;
	
	adc = R10K_TAB[val3];
	adc1 = R10K_TAB[val1];
	return adc+((adc1-adc)*val2);
}

/*
*****************************************************************
 * 函数原型： void Read_Temp(void)
 * 功    能： 读取温度-10ms
*****************************************************************
*/
void Read_Temp(void)
{
    static uint8_t Num;
    Num++;
    val = filter();//滤波获取adc的滑动平均值
    if(Num == 100)//1S
    {
        res = func_get_ntc_temp(val);//计算温度
        Num = 0;
    }
}
