#include "System_Init.h"

/*
*****************************************************************
 * 函数原型： void System_Init(void)
 * 功    能： 系统功能初始化
*****************************************************************
*/
void System_Init(void)
{
	/**********系统初始化成功**********/
	sys.Init_ok = 0;
	
	/**********EC11A初始化*************/
	EC11A_Init();

	/**********参数初始化**************/
    Param_Read();//读取参数

    /**********编码器初始化**********/
    Encoder_Init();
    
    /**********初始化lcd屏幕**********/
	Lcd_Init();
    
	/**********PID初始化***************/
    Motor_PID();
    
    /**********WS2812初始化************/
    WS2812_Init();
    
    /**********电机初始化**********/
	Drv_Motor_Init();
    
	/**********蜂鸣器响0.1S************/
    Beep_Time = 0.1;

	/***************系统初始化成功**********/
	sys.Init_ok = 1;
}
