#include "Drv_NTC.h"

/**********局部变量**********/
const uint16_t R100K_TAB[] = //R25=100K B25=3950K -25-150
{
//    91,//-25
//    97,//-24
//    103,//-23
//    109,//-22
//    115,//-21
    122,//-20
    129,//-19
    137,//-18
    145,//-17
    153,//-16
    161,//-15
    170,//-14
    180,//-13
    189,//-12
    200,//-11
    210,//-10
    221,//-9
    233,//-8
    245,//-7
    258,//-6
    271,//-5
    284,//-4
    298,//-3
    313,//-2
    328,//-1
    344,//0
    361,//1
    378,//2
    395,//3
    413,//4
    432,//5
    452,//6
    472,//7
    493,//8
    514,//9
    536,//10
    559,//11
    582,//12
    606,//13
    631,//14
    656,//15
    682,//16
    709,//17
    736,//18
    764,//19
    793,//20
    822,//21
    852,//22
    882,//23
    914,//24
    945,//25
    977,//26
    1010,//27
    1044,//28
    1077,//29
    1112,//30
    1147,//31
    1182,//32
    1218,//33
    1254,//34
    1290,//35
    1327,//36
    1364,//37
    1402,//38
    1440,//39
    1478,//40
    1516,//41
    1554,//42
    1593,//43
    1632,//44
    1670,//45
    1709,//46
    1748,//47
    1787,//48
    1826,//49
    1865,//50
    1904,//51
    1943,//52
    1981,//53
    2020,//54
    2058,//55
    2096,//56
    2134,//57
    2171,//58
    2209,//59
    2246,//60
    2282,//61
    2319,//62
    2355,//63
    2390,//64
    2426,//65
    2460,//66
    2495,//67
    2529,//68
    2562,//69
    2595,//70
    2628,//71
    2660,//72
    2692,//73
    2723,//74
    2754,//75
    2784,//76
    2813,//77
    2843,//78
    2871,//79
    2899,//80
    2927,//81
    2954,//82
    2981,//83
    3007,//84
    3032,//85
    3057,//86
    3082,//87
    3106,//88
    3129,//89
    3152,//90
    3175,//91
    3197,//92
    3218,//93
    3240,//94
    3260,//95
    3280,//96
    3300,//97
    3319,//98
    3338,//99
    3356,//100
    3374,//101
    3392,//102
    3409,//103
    3426,//104
    3442,//105
    3458,//106
    3473,//107
    3489,//108
    3503,//109
    3518,//110
    3532,//111
    3545,//112
    3559,//113
    3572,//114
    3585,//115
    3597,//116
    3609,//117
    3621,//118
    3632,//119
    3643,//120
    3654,//121
    3665,//122
    3675,//123
    3685,//124
    3695,//125
    3705,//126
    3714,//127
    3723,//128
    3732,//129
    3741,//130
    3749,//131
    3757,//132
    3765,//133
    3773,//134
    3781,//135
    3788,//136
    3795,//137
    3802,//138
    3809,//139
    3816,//140
    3822,//141
    3829,//142
    3835,//143
    3841,//144
    3847,//145
    3852,//146
    3858,//147
    3863,//148
    3869,//149
    3874,//150
};

/**********全局变量**********/
uint16_t ADC_Val;//adc的值
uint8_t NTC_Res;//温度采样返回的状态

/*
*****************************************************************
 * 函数原型： int Filter_ADC(void)
 * 功    能： 滑动平均值滤波
 * 输    出： 滤波后的值
*****************************************************************
*/
#define N 100//采集100次
int ADCvalue_Buf[N];//用于储存采集到的adc值
int i = 0;
int Filter_ADC(void)
{
    char count;
    long sum = 0;
    
    #if(Integration_TYPE <=1)//设置成四联和六联时
    HAL_ADC_Start(&hadc1);//开始读取adc的值
    ADCvalue_Buf[i++] = HAL_ADC_GetValue(&hadc1);//将adc的值储存
    #elif(Integration_TYPE == 2)//设置成八联时
    HAL_ADC_Start(&hadc1);//开始读取adc的值
    ADCvalue_Buf[i++] = HAL_ADC_GetValue(&hadc1);//将adc的值储存
    #endif
    if (i == N)//加入读了100组就从新开始
    {
        i = 0;
    }
    for (count = 0; count < N; count++)
    {
        sum += ADCvalue_Buf[count];//100组相加
    }
    if(ADCvalue_Buf[99] == 0)//如果没有读到100组就用第一次读到的数
        return ADCvalue_Buf[0];
    else//读到100组后
        return (int)(sum / N);//输出平均值
}

/*
*****************************************************************
 * 函数原型： uint16_t Get_Ntc_Temp(uint16_t value_adc)
 * 功    能： 计算出Ntc的温度
 * 输    入:  value_adc:adc读到的值
 * 参    数： uint16_t value_adc
*****************************************************************
*/
#define SHORT_CIRCUIT_THRESHOLD 15
#define OPEN_CIRCUIT_THRESHOLD 4096
uint8_t index_l, index_r ;
uint16_t Get_Ntc_Temp(uint16_t value_adc)
{
    uint8_t R100k_Tab_Size = 171;
    int temp = 0;
    if(value_adc <= SHORT_CIRCUIT_THRESHOLD)
    {
        return 1;
    }
    else if(value_adc >= OPEN_CIRCUIT_THRESHOLD)
    {
        return 2;
    }
    else if(value_adc < R100K_TAB[0])
    {
        return 3;
    }

    else if(value_adc > R100K_TAB[R100k_Tab_Size - 1])
    {
        return 4;
    }

    index_l = 0;
    index_r = R100k_Tab_Size - 1;
    for(; index_r - index_l > 1;)
    {
        if((value_adc <= R100K_TAB[index_r]) && (value_adc > R100K_TAB[(index_l + index_r) % 2 == 0 ? (index_l + index_r) / 2 : (index_l + index_r) / 2 ]))
        {
            index_l = (index_l + index_r) % 2 == 0 ? (index_l + index_r) / 2 : (index_l + index_r) / 2 ;
        }
        else
        {
            index_r = (index_l + index_r) / 2;
        }
    }
    if(R100K_TAB[index_l] == value_adc)
    {
        temp = (((int)index_l) - 20) * 10; //rate *10
    }
    else if(R100K_TAB[index_r] == value_adc)
    {
        temp = (((int)index_r) - 20) * 10; //rate *10
    }
    else
    {
        if(R100K_TAB[index_r] - R100K_TAB[index_l] == 0)
        {
            temp = (((int)index_l) - 20) * 10; //rate *10
        }
        else
        {
            temp = (((int)index_l) - 20) * 10 + ((value_adc - R100K_TAB[index_l] ) * 100 + 5) / 10 / (R100K_TAB[index_r] - R100K_TAB[index_l]);
        }
    }

    /******************温度补偿*********************/
    Ture_Temp = temp;//测得温度赋值
    return 0;
}

/*
*****************************************************************
 * 函数原型： void Read_Temp(void)
 * 功    能： 读取温度-10ms
*****************************************************************
*/
void Read_Temp(void)
{
    static uint8_t Num;
    Num++;
    ADC_Val = Filter_ADC();//滤波获取adc的滑动平均值
    if(Num == 100)//1S
    {
        NTC_Res = Get_Ntc_Temp(ADC_Val);//计算温度
        Num = 0;
    }
}
