#include "System_Init.h"

/*
*****************************************************************
 * 函数原型：void System_Init(void)
 * 功    能：系统功能初始化
*****************************************************************
*/
void System_Init(void)
{
	/**********系统初始化开始**********/
	sys.Init_ok = 0;
	
	/**********参数初始化**************/
	Param_Read();
    
	/**********LCD初始化***************/
	Lcd_Init();
	
	/**********电机初始化**************/
	Motor_Init();
	
	/**********编码器初始化************/
	Encoder_Init();
	
	/**********电机PID系数*************/
	Motor_PID();

    /**********蜂鸣器响0.1S************/  
	Beep_Time = 0.1;
    
	/**********系统初始化成功**********/
	sys.Init_ok = 1;
}
