#include "Ctrl_Motor.h"
uint16_t Speed_PWM[111]={80 ,80 ,80 ,80 ,80 ,80 ,80 ,80 ,80 ,80 ,80 ,80 ,80 ,80 ,80 ,80 ,84 ,88 ,93 ,98 ,/*1000-2900*/
						 99,101,107,110,114,118,124,129,138,142,146,150,156,163,169,174,180,187,194,200,/*3000-4900*/
						 206,215,222,228,236,245,252,261,269,277,288,300,308,317,324,334,348,359,372,383,/*5000-6900*/
						 395,409,419,434,450,465,480,486,493,511,524,546,562,576,593,608,627,643,659,689,/*7000-8900*/
						 704,724,747,767,785,805,818,830,840,850,860,870,880,890,900,910,920,930,940,950,/*9000-10900*/
						 960,967,968,969,970,971,972,973,974,975,980/*11000-12000*/
						};
uint16_t Speed_Val[111]={1000,1100,1200,1300,1400,1500,1600,1700,1800,1900,2000,2100,2200,2300,2400,2500,2600,2700,2800,2900,/*1000-2900*/
						 3000,3100,3200,3300,3400,3500,3600,3700,3800,3900,4000,4100,4200,4300,4400,4500,4600,4700,4800,4900,/*3000-4900*/
						 5000,5100,5200,5300,5400,5500,5600,5700,5800,5900,6000,6100,6200,6300,6400,6500,6600,6700,6800,6900,/*5000-6900*/
						 7000,7100,7200,7300,7400,7500,7600,7700,7800,7900,8000,8100,8200,8300,8400,8500,8600,8700,8800,8900,/*7000-8900*/
						 9000,9100,9200,9300,9400,9500,9600,9700,9800,9900,10000,10100,10200,10300,10400,10500,10600,10700,10800,10900,/*9000-10900*/
						 11000,11100,11200,11300,11400,11500,11600,11700,11800,11900,12000/*11000-12000*/
						};
uint16_t xg_Val[111]={  67  ,81  ,97  ,113 ,131 ,151 ,172 ,194 ,217 ,242 ,268 ,296 ,325 ,355 ,386 ,419 ,453 ,489 ,526 ,564 ,
						604 ,645 ,687 ,731 ,775 ,822 ,869 ,918 ,969 ,1020,1073,1128,1183,1240,1299,1358,1419,1482,1546,1611,
						1677,1745,1814,1884,1956,2029,2104,2179,2257,2335,2415,2496,2579,2662,2748,2834,2922,3011,3102,3194,
						3287,3382,3477,3575,3673,3773,3875,3977,4081,4186,4293,4401,4510,4621,4733,4847,4961,5077,5195,5313,
						5433,5555,5678,5802,5927,6054,6182,6312,6442,6575,6708,6843,6979,7117,7255,7396,7537,7680,7824,7970,
						8117,8265,8415,8565,8718,8871,9026,9183,9340,9499,9660
						};


/*
*****************************************************************
 * 函数原型：void Motor_Ctrl(float dT)
 * 功    能：电机控制
*****************************************************************
*/
void Motor_Ctrl(float dT)
{   
	static uint16_t Convert_Set,Ctrl_Val;//pwm的值
    if(sys.Run_Status == 1)//启动
    {
		if(HAL_GPIO_ReadPin(BREAKEZ_GPIO_Port,BREAKEZ_Pin)== 1)//电磁锁闭合时
		{
			if(Ctrl_Speed && ((DownTime_Over == 0)||(Ctrl_Time)))//速度大于0和定时器没有结束
			{
				if(Speed_Mode)
					Convert_Set = Speed_PWM[Val_xg];
				else
					Convert_Set = Speed_PWM[Val_Speed];
				if(Ctrl_Val < Convert_Set)//如果控制值小于要达到的值
				{
					Ctrl_Val++;//控制值++
					Rel_Speed = ((float)Ctrl_Val/(float)Convert_Set)*Ctrl_Speed;//计算出各个控制值下的速度
					if(Speed_Mode==0)//速度	
					{
						Rel_Speed = ((float)Ctrl_Val/(float)Convert_Set)*Ctrl_Speed;//计算出各个控制值下的速度
					}
					else//离心力
					{
						Rel_Speed = ((float)Ctrl_Val/(float)Convert_Set)*xg_Val[Val_xg];//计算出各个控制值下的速度
					}
				}
				PWM = Ctrl_Val;//PWM赋值
			}
			else
			{
				if(Ctrl_Val)
				{
					Ctrl_Val--;
					if(Speed_Mode==0)//速度
					{
						Rel_Speed = ((float)Ctrl_Val/(float)Convert_Set)*Ctrl_Speed;//计算出各个控制值下的速度
					}
					else//离心力
					{
						Rel_Speed = ((float)Ctrl_Val/(float)Convert_Set)*xg_Val[Val_xg];//计算出各个控制值下的速度
					}
				}
				else//速度为零时
				{
					sys.Run_Status = 0;//关闭系统
				}
				PWM = Ctrl_Val;//PWM赋值
			}
		}
		else//盖子打开
		{
			sys.Run_Status = 0;//关闭系统
			Rel_Speed = 0;//不清零显示一直时实际转速
			Ctrl_Val = 0;//控制值清零
			PWM = Ctrl_Val;//PWM赋值
		}
    }
    else//系统关闭
    {
		if(Ctrl_Val)//控制值未清理
		{
			Ctrl_Val--;//控制值--
			if(Speed_Mode==0)//速度	
			{
				Rel_Speed = ((float)Ctrl_Val/(float)Convert_Set)*Ctrl_Speed;//计算出各个控制值下的速度
			}
			else//离心力
			{
				Rel_Speed = ((float)Ctrl_Val/(float)Convert_Set)*xg_Val[Val_xg];//计算出各个控制值下的速度
			}
		}
		PWM = Ctrl_Val;//PWM赋值
    }      
}

/*
*****************************************************************
 * 函数原型：void Check_MotorStop(float dT)
 * 功    能：检测电机是否停止，停止后开盖
*****************************************************************
*/
void Check_MotorStop(float dT)
{
	static float T;
	if(sys.Motor_Stop)
	{
		if(Rel_Speed == 0)
		{
			T += dT;
			if(T>4.0f)
			{
				Lock_Status = 1;//电磁锁打开
				SetOK_Flag = 1;//设置参数置一
				sys.Motor_Stop = 0;//电机已经停止
				T = 0;
			}
		}
		else
		{
			T = 0;
		}
	}
	else
	{
		T = 0;
	}
}
