#include "System_Init.h"

/*
*****************************************************************
 * 函数原型： void System_Init(void)
 * 功    能： 系统功能初始化
*****************************************************************
*/
void System_Init(void)
{
	/**********系统初始化成功**********/
	sys.Init_ok = 0;
	
	/**********EC11A初始化定时器*******/
	EC11A_Init();
	
	/**********参数初始化**************/
	Param_Read();
	
	/**********电机初始化**************/
	Motor_Init();
	
	/**********编码器初始化************/
    Encoder_Init();
	
	/**********PID系数初始化***********/
	Motor_PID();
	
	/**********开机蜂鸣器响************/
	Beep_Time = 0.1;//蜂鸣器响0.1S
	
	/**********系统初始化成功**********/
	sys.Init_ok = 1;
}
