#ifndef _MYTYPE_H_
#define _MYTYPE_H_

/*******************************************************
					位定义
********************************************************/
#define	Set(x,y)	((x) |= (1 << (y)))				//位置1
#define	Clr(x,y)	((x) &= ~ (1 << (y)))			//位清0

#define	b0(x,y)		(((x) & (1 << (y))) == 0)		//位0判断 if(b0(x,y)) 判断是否为0
#define	b1(x,y)		((x) & (1 << (y)))				//位1判断 if(b1(x,y)) 判断是否为1

#define TestOne(Ram,Bit)	(Ram & (1<<Bit))	//测试寄存器Ram的Bit位是否为1
#define TestZero(Ram,Bit)	!(Ram & (1<<Bit))	//测试寄存器Ram的Bit位是否为0
/*******************************************************
					宏定义
********************************************************/
#define uchar	unsigned char
#define uint	unsigned int
#define ulong	unsigned long
/*******************************************************/
/*******************************************************/
/*******************************************************/
#endif
