;**********************************************************
;**********************************************************
;文 件 名:Touch_Kscan_Library.H
;触摸定义文件，包括按键消抖次数设置、每个按键灵敏度设置、每个按键内部并联电容设置、按键通道设置
;**********************************************************
;每个按键对应于寄存器KEYF的1个位,由高至低一一对应
;KEYF对应于Key8,...,Key2,Key1
;按键有效时相应位为1,无效时为0

;TK_FLAG,B_KERR触摸按键复位标志

;KeyOnceOver,KeyOnceHave,KeySleepStr触摸按键休眠相关标志
;**********************************************************
;调试模式使能
;0:不使能
;1:使能
#define		CMS_DEBUG_MODE	0



;#define		C_KWATER					;防水/组合键模式选择,不定义为组合键模式
#define		C_KCOUNT		4				;范围1~8,按键个数
#define		C_KEY_CHANNEL	0x3C			;通道使能,芯片管脚上的TK0~TK7分别对应bit0~bit7

#define		C_VALID_KEY		2				;范围1~255,同时最大允许有效按键数,超过该值将认为是干扰
#define		C_VALID_TIME	(1000/4)*60		;范围0~65535,按键最大允许生效时间,以4ms为基准换算,为0时将忽略
;----------------------------------------------------------
C_KEYC		DEF		.2		;按键消抖次数
;----------------------------------------------------------
;按键灵敏度设置常量10~255
C_KEY1_LMD	DEF		.40		;KEY1灵敏度
C_KEY2_LMD	DEF		.40		;KEY2灵敏度
C_KEY3_LMD	DEF		.40		;KEY3灵敏度
C_KEY4_LMD	DEF		.40		;KEY4灵敏度
C_KEY5_LMD	DEF		.40		;KEY5灵敏度
C_KEY6_LMD	DEF		.40		;KEY6灵敏度
C_KEY7_LMD	DEF		.40		;KEY7灵敏度
C_KEY8_LMD	DEF		.40		;KEY8灵敏度
;----------------------------------------------------------
;----------------------------------------------------------
;各触摸检测通道对应的按键序号0x00~0x07
;未使用的通道设置为0x80
C_KEY1_CH	DEF		0x80	;触摸通道对应芯片管脚上的TK0
C_KEY2_CH	DEF		0x80	;触摸通道对应芯片管脚上的TK1
C_KEY3_CH	DEF		0x80	;触摸通道Key1对应芯片管脚上的TK2
C_KEY4_CH	DEF		0x80	;触摸通道Key2对应芯片管脚上的TK3
C_KEY5_CH	DEF		0x80	;触摸通道Key3对应芯片管脚上的TK4
C_KEY6_CH	DEF		0x80	;触摸通道Key4对应芯片管脚上的TK5
C_KEY7_CH	DEF		0x80	;触摸通道对应芯片管脚上的TK6
C_KEY8_CH	DEF		0x80	;触摸通道对应芯片管脚上的TK7
;----------------------------------------------------------






;***********************************************************
;下面的内容一般情况不用修改
;***********************************************************
;----------------------------------------------------------
;各触摸检测通道检测时间选择 160~240，值最大，检测时间越短，触摸变化量越小
C_KEY1_TMR	DEF		.220		;KEY1检测时间
C_KEY2_TMR	DEF		.220		;KEY2检测时间
C_KEY3_TMR	DEF		.220		;KEY3检测时间
C_KEY4_TMR	DEF		.220		;KEY4检测时间
C_KEY5_TMR	DEF		.220		;KEY5检测时间
C_KEY6_TMR	DEF		.220		;KEY6检测时间
C_KEY7_TMR	DEF		.220		;KEY7检测时间
C_KEY8_TMR	DEF		.220		;KEY8检测时间

;按键检测频率选择0~3
#define		KEY_FRESET		3;0~3

;按键检测频率模式选择0~3
#define		KEY_FREMODE		3;0~3

;倍频
;0：不使能
;1：使能
#define		KEY_FREDFEN		1;0~1

;滤波
;0：不使能
;1：使能
#define		KEY_FRELB		0;0~1


